Ran Plan for project: `apps` dir: `terragrunt-integration/terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
>>>> PLANNING CHANGES <<<<

/home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/27/default/terragrunt-integration/terraform

22:46:39.379 WARN   The `TERRAGRUNT_TFPATH` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_PATH=terraform1.11.4` instead.
22:46:39.384 INFO   The runner at . will be processed in the following order for command plan:
Group 1
- Unit .
- Unit ./modules/random

Group 2
- Unit ./app1
- Unit ./app2


22:46:39.411 INFO   Downloading Terraform configurations from ./modules/random into ./.terragrunt-cache/WyB4j1mopDdSTe5P8ur9WdS7ypA/s49TZhSNmcEg6Qea0qIFl14U98Q
22:46:39.435 INFO   [modules/random] terraform1.11.4: Initializing the backend...
22:46:39.436 INFO   [modules/random] terraform1.11.4: Initializing provider plugins...
22:46:39.436 INFO   [modules/random] terraform1.11.4: - Finding latest version of hashicorp/random...
22:46:39.440 INFO   terraform1.11.4: Initializing the backend...
22:46:39.440 INFO   terraform1.11.4: Initializing provider plugins...
22:46:39.440 INFO   terraform1.11.4: - Finding latest version of hashicorp/random...
22:46:41.371 INFO   [modules/random] terraform1.11.4: - Installing hashicorp/random v3.7.2...
22:46:41.394 INFO   terraform1.11.4: - Installing hashicorp/random v3.7.2...
22:46:42.006 INFO   [modules/random] terraform1.11.4: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
22:46:42.006 INFO   [modules/random] terraform1.11.4: Terraform has created a lock file .terraform.lock.hcl to record the provider
22:46:42.006 INFO   [modules/random] terraform1.11.4: selections it made above. Include this file in your version control repository
22:46:42.006 INFO   [modules/random] terraform1.11.4: so that Terraform can guarantee to make the same selections by default when
22:46:42.006 INFO   [modules/random] terraform1.11.4: you run "terraform init" in the future.
22:46:42.006 INFO   [modules/random] terraform1.11.4: Terraform has been successfully initialized!
22:46:42.139 STDOUT [modules/random] terraform1.11.4: Terraform used the selected providers to generate the following execution
22:46:42.139 STDOUT [modules/random] terraform1.11.4: plan. Resource actions are indicated with the following symbols:
22:46:42.139 STDOUT [modules/random] terraform1.11.4:   + create
22:46:42.139 STDOUT [modules/random] terraform1.11.4: Terraform will perform the following actions:
22:46:42.139 STDOUT [modules/random] terraform1.11.4:   # random_string.base_bucket_name will be created
22:46:42.139 STDOUT [modules/random] terraform1.11.4:   + resource "random_string" "base_bucket_name" {
22:46:42.139 STDOUT [modules/random] terraform1.11.4:       + id          = (known after apply)
22:46:42.139 STDOUT [modules/random] terraform1.11.4:       + length      = 4
22:46:42.139 STDOUT [modules/random] terraform1.11.4:       + lower       = true
22:46:42.139 STDOUT [modules/random] terraform1.11.4:       + min_lower   = 0
22:46:42.139 STDOUT [modules/random] terraform1.11.4:       + min_numeric = 0
22:46:42.140 STDOUT [modules/random] terraform1.11.4:       + min_special = 0
22:46:42.140 STDOUT [modules/random] terraform1.11.4:       + min_upper   = 0
22:46:42.140 STDOUT [modules/random] terraform1.11.4:       + number      = false
22:46:42.140 STDOUT [modules/random] terraform1.11.4:       + numeric     = false
22:46:42.140 STDOUT [modules/random] terraform1.11.4:       + result      = (known after apply)
22:46:42.140 STDOUT [modules/random] terraform1.11.4:       + special     = false
22:46:42.140 STDOUT [modules/random] terraform1.11.4:       + upper       = true
22:46:42.140 STDOUT [modules/random] terraform1.11.4:     }
22:46:42.140 STDOUT [modules/random] terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
22:46:42.140 STDOUT [modules/random] terraform1.11.4: 
22:46:42.140 STDOUT [modules/random] terraform1.11.4: Changes to Outputs:
22:46:42.140 STDOUT [modules/random] terraform1.11.4:   + base_bucket_name = (known after apply)
22:46:42.385 INFO   terraform1.11.4: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
22:46:42.385 INFO   terraform1.11.4: Terraform has created a lock file .terraform.lock.hcl to record the provider
22:46:42.385 INFO   terraform1.11.4: selections it made above. Include this file in your version control repository
22:46:42.385 INFO   terraform1.11.4: so that Terraform can guarantee to make the same selections by default when
22:46:42.385 INFO   terraform1.11.4: you run "terraform init" in the future.
22:46:42.385 INFO   terraform1.11.4: Terraform has been successfully initialized!
22:46:42.508 STDOUT terraform1.11.4: Terraform used the selected providers to generate the following execution
22:46:42.508 STDOUT terraform1.11.4: plan. Resource actions are indicated with the following symbols:
22:46:42.508 STDOUT terraform1.11.4:   + create
22:46:42.508 STDOUT terraform1.11.4: Terraform will perform the following actions:
22:46:42.508 STDOUT terraform1.11.4:   # random_string.base_bucket_name will be created
22:46:42.508 STDOUT terraform1.11.4:   + resource "random_string" "base_bucket_name" {
22:46:42.508 STDOUT terraform1.11.4:       + id          = (known after apply)
22:46:42.508 STDOUT terraform1.11.4:       + length      = 4
22:46:42.508 STDOUT terraform1.11.4:       + lower       = true
22:46:42.508 STDOUT terraform1.11.4:       + min_lower   = 0
22:46:42.508 STDOUT terraform1.11.4:       + min_numeric = 0
22:46:42.508 STDOUT terraform1.11.4:       + min_special = 0
22:46:42.508 STDOUT terraform1.11.4:       + min_upper   = 0
22:46:42.508 STDOUT terraform1.11.4:       + number      = false
22:46:42.508 STDOUT terraform1.11.4:       + numeric     = false
22:46:42.508 STDOUT terraform1.11.4:       + result      = (known after apply)
22:46:42.508 STDOUT terraform1.11.4:       + special     = false
22:46:42.508 STDOUT terraform1.11.4:       + upper       = true
22:46:42.508 STDOUT terraform1.11.4:     }
22:46:42.508 STDOUT terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
22:46:42.508 STDOUT terraform1.11.4: 
22:46:42.508 STDOUT terraform1.11.4: Changes to Outputs:
22:46:42.508 STDOUT terraform1.11.4:   + base_bucket_name = (known after apply)
22:46:42.515 INFO   Downloading Terraform configurations from ./modules/random into ./.terragrunt-cache/WyB4j1mopDdSTe5P8ur9WdS7ypA/s49TZhSNmcEg6Qea0qIFl14U98Q
22:46:42.539 INFO   terraform1.11.4: Initializing the backend...
22:46:42.549 INFO   terraform1.11.4: Initializing provider plugins...
22:46:42.550 INFO   terraform1.11.4: - Reusing previous version of hashicorp/random from the dependency lock file
22:46:42.929 INFO   terraform1.11.4: - Using previously-installed hashicorp/random v3.7.2
22:46:42.929 INFO   terraform1.11.4: Terraform has been successfully initialized!
22:46:42.965 WARN   [app1] Config ./commons.hcl is a dependency of ./app1/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
22:46:42.966 WARN   [app2] Config ./commons.hcl is a dependency of ./app2/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
22:46:42.966 INFO   [app1] Downloading Terraform configurations from ./modules/s3-bucket into ./app1/.terragrunt-cache/F8-OE_oJ2AjINXTJ1fk1c5Uh15g/yhr4kRkp6W1Gh-9EKgSRI9VZGBM
22:46:42.966 INFO   [app2] Downloading Terraform configurations from ./modules/s3-bucket into ./app2/.terragrunt-cache/Qb4OiolJqMpiuLEGPOzxPLJnr1Y/yhr4kRkp6W1Gh-9EKgSRI9VZGBM
22:46:42.988 INFO   [app2] terraform1.11.4: Initializing the backend...
22:46:42.989 INFO   [app2] terraform1.11.4: Initializing provider plugins...
22:46:42.989 INFO   [app2] terraform1.11.4: - Finding hashicorp/aws versions matching "~> 5.0"...
22:46:42.990 INFO   [app1] terraform1.11.4: Initializing the backend...
22:46:42.990 INFO   [app1] terraform1.11.4: Initializing provider plugins...
22:46:42.990 INFO   [app1] terraform1.11.4: - Finding hashicorp/aws versions matching "~> 5.0"...
22:46:43.455 INFO   [app1] terraform1.11.4: - Installing hashicorp/aws v5.100.0...
22:46:43.455 INFO   [app2] terraform1.11.4: - Installing hashicorp/aws v5.100.0...
22:47:01.250 INFO   [app2] terraform1.11.4: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
22:47:01.250 INFO   [app2] terraform1.11.4: Terraform has made some changes to the provider dependency selections recorded
22:47:01.250 INFO   [app2] terraform1.11.4: in the .terraform.lock.hcl file. Review those changes and commit them to your
22:47:01.250 INFO   [app2] terraform1.11.4: version control system if they represent changes you intended to make.
22:47:01.250 INFO   [app2] terraform1.11.4: Terraform has been successfully initialized!
22:47:03.852 STDOUT [app2] terraform1.11.4: Terraform used the selected providers to generate the following execution
22:47:03.852 STDOUT [app2] terraform1.11.4: plan. Resource actions are indicated with the following symbols:
22:47:03.852 STDOUT [app2] terraform1.11.4:   + create
22:47:03.852 STDOUT [app2] terraform1.11.4: Terraform will perform the following actions:
22:47:03.853 STDOUT [app2] terraform1.11.4:   # aws_s3_bucket.this will be created
22:47:03.853 STDOUT [app2] terraform1.11.4:   + resource "aws_s3_bucket" "this" {
22:47:03.853 STDOUT [app2] terraform1.11.4:       + acceleration_status         = (known after apply)
22:47:03.853 STDOUT [app2] terraform1.11.4:       + acl                         = "private"
22:47:03.853 STDOUT [app2] terraform1.11.4:       + arn                         = (known after apply)
22:47:03.853 STDOUT [app2] terraform1.11.4:       + bucket                      = "app2-dev-base-name"
22:47:03.853 STDOUT [app2] terraform1.11.4:       + bucket_domain_name          = (known after apply)
22:47:03.853 STDOUT [app2] terraform1.11.4:       + bucket_prefix               = (known after apply)
22:47:03.853 STDOUT [app2] terraform1.11.4:       + bucket_regional_domain_name = (known after apply)
22:47:03.853 STDOUT [app2] terraform1.11.4:       + force_destroy               = false
22:47:03.853 STDOUT [app2] terraform1.11.4:       + hosted_zone_id              = (known after apply)
22:47:03.853 STDOUT [app2] terraform1.11.4:       + id                          = (known after apply)
22:47:03.853 STDOUT [app2] terraform1.11.4:       + object_lock_enabled         = (known after apply)
22:47:03.853 STDOUT [app2] terraform1.11.4:       + policy                      = (known after apply)
22:47:03.853 STDOUT [app2] terraform1.11.4:       + region                      = (known after apply)
22:47:03.853 STDOUT [app2] terraform1.11.4:       + request_payer               = (known after apply)
22:47:03.853 STDOUT [app2] terraform1.11.4:       + tags_all                    = (known after apply)
22:47:03.854 STDOUT [app2] terraform1.11.4:       + website_domain              = (known after apply)
22:47:03.854 STDOUT [app2] terraform1.11.4:       + website_endpoint            = (known after apply)
22:47:03.854 STDOUT [app2] terraform1.11.4:       + cors_rule (known after apply)
22:47:03.854 STDOUT [app2] terraform1.11.4:       + grant (known after apply)
22:47:03.854 STDOUT [app2] terraform1.11.4:       + lifecycle_rule (known after apply)
22:47:03.854 STDOUT [app2] terraform1.11.4:       + logging (known after apply)
22:47:03.854 STDOUT [app2] terraform1.11.4:       + object_lock_configuration (known after apply)
22:47:03.854 STDOUT [app2] terraform1.11.4:       + replication_configuration (known after apply)
22:47:03.854 STDOUT [app2] terraform1.11.4:       + server_side_encryption_configuration (known after apply)
22:47:03.854 STDOUT [app2] terraform1.11.4:       + versioning (known after apply)
22:47:03.854 STDOUT [app2] terraform1.11.4:       + website (known after apply)
22:47:03.854 STDOUT [app2] terraform1.11.4:     }
22:47:03.854 STDOUT [app2] terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
22:47:03.854 STDOUT [app2] terraform1.11.4: 
22:47:03.854 STDOUT [app2] terraform1.11.4: Changes to Outputs:
22:47:03.854 STDOUT [app2] terraform1.11.4:   + bucket_arn = (known after apply)
22:47:03.854 STDOUT [app2] terraform1.11.4: ╷
22:47:03.854 STDOUT [app2] terraform1.11.4: │ Warning: Argument is deprecated
22:47:03.854 STDOUT [app2] terraform1.11.4: │ 
22:47:03.854 STDOUT [app2] terraform1.11.4: │   with aws_s3_bucket.this,
22:47:03.854 STDOUT [app2] terraform1.11.4: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
22:47:03.854 STDOUT [app2] terraform1.11.4: │   17:   acl    = "private"
22:47:03.854 STDOUT [app2] terraform1.11.4: │ 
22:47:03.854 STDOUT [app2] terraform1.11.4: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
22:47:03.854 STDOUT [app2] terraform1.11.4: │ 
22:47:03.854 STDOUT [app2] terraform1.11.4: │ (and one more similar warning elsewhere)
22:47:03.854 STDOUT [app2] terraform1.11.4: ╵
22:47:05.644 INFO   [app1] terraform1.11.4: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
22:47:05.644 INFO   [app1] terraform1.11.4: Terraform has created a lock file .terraform.lock.hcl to record the provider
22:47:05.644 INFO   [app1] terraform1.11.4: selections it made above. Include this file in your version control repository
22:47:05.644 INFO   [app1] terraform1.11.4: so that Terraform can guarantee to make the same selections by default when
22:47:05.644 INFO   [app1] terraform1.11.4: you run "terraform init" in the future.
22:47:05.644 INFO   [app1] terraform1.11.4: Terraform has been successfully initialized!
22:47:08.291 STDOUT [app1] terraform1.11.4: Terraform used the selected providers to generate the following execution
22:47:08.291 STDOUT [app1] terraform1.11.4: plan. Resource actions are indicated with the following symbols:
22:47:08.291 STDOUT [app1] terraform1.11.4:   + create
22:47:08.291 STDOUT [app1] terraform1.11.4: Terraform will perform the following actions:
22:47:08.291 STDOUT [app1] terraform1.11.4:   # aws_s3_bucket.this will be created
22:47:08.291 STDOUT [app1] terraform1.11.4:   + resource "aws_s3_bucket" "this" {
22:47:08.291 STDOUT [app1] terraform1.11.4:       + acceleration_status         = (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + acl                         = "private"
22:47:08.291 STDOUT [app1] terraform1.11.4:       + arn                         = (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + bucket                      = "app1-new9-dev-base-name"
22:47:08.291 STDOUT [app1] terraform1.11.4:       + bucket_domain_name          = (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + bucket_prefix               = (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + bucket_regional_domain_name = (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + force_destroy               = false
22:47:08.291 STDOUT [app1] terraform1.11.4:       + hosted_zone_id              = (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + id                          = (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + object_lock_enabled         = (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + policy                      = (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + region                      = (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + request_payer               = (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + tags_all                    = (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + website_domain              = (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + website_endpoint            = (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + cors_rule (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + grant (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + lifecycle_rule (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + logging (known after apply)
22:47:08.291 STDOUT [app1] terraform1.11.4:       + object_lock_configuration (known after apply)
22:47:08.292 STDOUT [app1] terraform1.11.4:       + replication_configuration (known after apply)
22:47:08.292 STDOUT [app1] terraform1.11.4:       + server_side_encryption_configuration (known after apply)
22:47:08.292 STDOUT [app1] terraform1.11.4:       + versioning (known after apply)
22:47:08.292 STDOUT [app1] terraform1.11.4:       + website (known after apply)
22:47:08.292 STDOUT [app1] terraform1.11.4:     }
22:47:08.292 STDOUT [app1] terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
22:47:08.292 STDOUT [app1] terraform1.11.4: 
22:47:08.292 STDOUT [app1] terraform1.11.4: Changes to Outputs:
22:47:08.292 STDOUT [app1] terraform1.11.4:   + bucket_arn = (known after apply)
22:47:08.292 STDOUT [app1] terraform1.11.4: ╷
22:47:08.292 STDOUT [app1] terraform1.11.4: │ Warning: Argument is deprecated
22:47:08.292 STDOUT [app1] terraform1.11.4: │ 
22:47:08.292 STDOUT [app1] terraform1.11.4: │   with aws_s3_bucket.this,
22:47:08.292 STDOUT [app1] terraform1.11.4: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
22:47:08.292 STDOUT [app1] terraform1.11.4: │   17:   acl    = "private"
22:47:08.292 STDOUT [app1] terraform1.11.4: │ 
22:47:08.292 STDOUT [app1] terraform1.11.4: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
22:47:08.292 STDOUT [app1] terraform1.11.4: │ 
22:47:08.292 STDOUT [app1] terraform1.11.4: │ (and one more similar warning elsewhere)
22:47:08.292 STDOUT [app1] terraform1.11.4: ╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p apps
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://890ca2a7b7e7.ngrok-free.app/lock?id=jefersonlemos%252Fatlantis-playground%252Fterragrunt-integration%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p apps
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```